package e

var (
	// Opposite 阴阳(索引值为其常量)
	Opposite = []string{"阴", "阳"}

	// Element 五行(索引值为其常量)
	Element = []string{"水", "木", "火", "土", "金"}

	// Gan 天干(索引值为其常量)
	Gan = []string{"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"}

	// G2E 天干对应五行(较少使用，使用算法解决)
	G2E = []int{1, 1, 2, 2, 3, 3, 4, 4, 0, 0}

	// Zhi 地支(索引值为其常量)
	Zhi = []string{"子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"}

	// Z2E 地支对应五行索引
	Z2E = []int{0, 3, 1, 1, 3, 2, 2, 3, 4, 4, 3, 0}

	// ZwG 地支藏干 第一个为本气(主气),第二个为中气,第三个为余气，
	ZwG = [][]int{{9}, {5, 7, 9}, {0, 2, 4}, {1}, {4, 1, 9}, {2, 6, 4}, {3, 5}, {5, 3, 1}, {6, 8, 4}, {7}, {4, 7, 3}, {8, 0}}

	// Spirits5 五神(索引值为其常量)
	Spirits5 = []string{"印绶", "比肩", "伤官", "妻财", "官杀"}

	// HH3 三合三会编码
	HH3 = map[string]string{
		"048": "804",
		"159": "591",
		"26A": "26A",
		"37B": "B37",
		"234": "234",
		"567": "567",
		"89A": "89A",
		"01B": "B01",
	}
)
